tests/mutations/ha-duplicate-read-fanout.patch
diff --git a/components/espcontrol/ha_state_broker.h b/components/espcontrol/ha_state_broker.h
--- a/components/espcontrol/ha_state_broker.h
+++ b/components/espcontrol/ha_state_broker.h
@@ -156,6 +156,6 @@ class StateBroker {
     for (std::size_t index = 0; index < channels_.size(); ++index) {
       const Channel &channel = channels_[index];
-      if (channel.active && channel.entity_id == entity_id &&
+      if (channel.active && channel.entity_id != entity_id &&
           channel.attribute == attribute) {
         return index;
       }
